#### **Análisis del dataset Titanic**
___
##### **Autor:** Peitsch, Pablo    **Github:** <a href="https://github.com/PPeitsch/07_infografia">@PPeitsch</a>    **Email:** <a href="mailto:preynosopeitsch@estudiantes.unsam.edu.ar">preynosopeitsch@estudiantes.unsam.edu.ar</a>    **Fecha:** 20/03/2023

In [44]:
source('process.r')

In [52]:
min_ticket <- min(df_titanic$fare)
max_ticket <- max(df_titanic$fare)
mean_ticket <- mean(df_titanic$fare)

min_age <- min(df_titanic$age)
max_age <- max(df_titanic$age)
mean_age <- mean(df_titanic$age)

In [53]:
min_ticket

[1] 4.0125

In [36]:
str(df_titanic)

'data.frame':	889 obs. of  10 variables:
 $ sex     : chr  "male" "male" "male" "male" ...
 $ age     : num  39 20 33 61 34.5 43 34 18 19 18 ...
 $ siblings: int  0 0 0 0 0 0 0 1 0 0 ...
 $ parents : int  0 0 0 0 0 0 0 0 0 0 ...
 $ fare    : num  7.18 4.01 5 6.24 6.44 ...
 $ port    : chr  "S" "C" "S" "S" ...
 $ class   : chr  "First" "Third" "First" "Third" ...
 $ who     : chr  "man" "man" "man" "man" ...
 $ alone   : logi  TRUE TRUE TRUE TRUE TRUE TRUE ...
 $ survived: chr  "no" "no" "no" "no" ...

In [37]:
head(df_titanic, 5)

  sex  age  siblings parents fare   port class who alone survived
1 male 39.0 0        0       7.1800 S    First man TRUE  no
2 male 20.0 0        0       4.0125 C    Third man TRUE  no
3 male 33.0 0        0       5.0000 S    First man TRUE  no
4 male 61.0 0        0       6.2375 S    Third man TRUE  no
5 male 34.5 0        0       6.4375 C    Third man TRUE  no

In [38]:
glimpse(df_titanic)

Rows: 889
Columns: 10
$ sex      <chr> "male", "male", "male", "male", "male", "male", "male", "male…
$ age      <dbl> 39.0, 20.0, 33.0, 61.0, 34.5, 43.0, 34.0, 18.0, 19.0, 18.0, N…
$ siblings <int> 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0…
$ parents  <int> 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0…
$ fare     <dbl> 7.1800, 4.0125, 5.0000, 6.2375, 6.4375, 6.4500, 6.4958, 6.495…
$ port     <chr> "S", "C", "S", "S", "C", "S", "S", "S", "Q", "Q", "Q", "Q", "…
$ class    <chr> "First", "Third", "First", "Third", "Third", "Third", "Third"…
$ who      <chr> "man", "man", "man", "man", "man", "man", "man", "man", "man"…
$ alone    <lgl> TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, FALSE, TRUE, TRUE, …
$ survived <chr> "no", "no", "no", "no", "no", "no", "no", "no", "no", "no", "…

In [41]:
typeof(df_titanic)

[1] "list"

In [ ]:
min()